/**
 * var 变量提升
 */
myName = 'Chris'

function logName() {
  console.log(myName)
}

logName()

let myName

// -------------- (ﾉ･ω･)ﾉﾞ(○’ω’○)(´・ω・`) (｡◕ˇ∀ˇ◕）(●'◡'●)ﾉ♥ <(▰˘◡˘▰)> ｡◕‿◕｡ (｡・`ω´･) (♥◠‿◠)ﾉ ------------------

/**
 * 函数提升，只会提升函数声明，而不会提升函数表达式
 */

f()
// fn()

/**
 * 函数表达式
 */
var fn = function () {
  console.log(1)
}

/**
 * 函数声明
 */
function f() {
  console.log(0)
}

// -------------- (ﾉ･ω･)ﾉﾞ(○’ω’○)(´・ω・`) (｡◕ˇ∀ˇ◕）(●'◡'●)ﾉ♥ <(▰˘◡˘▰)> ｡◕‿◕｡ (｡・`ω´･) (♥◠‿◠)ﾉ ------------------

/**
 * var 全局变量，这里输出的是 10 而不是 6；如果用 let 就是 6
 */
var a = []
for (var i = 0; i < 10; i++) {
  a[i] = function () {
    console.log(i)
  }
}
a[6]()
// 10
